---
kind: property
id: P:Autodesk.Revit.DB.Electrical.CableTrayType.IsWithFitting
source: html/e3a9e255-4622-c09d-af53-9b8f3af9cf26.htm
---
# Autodesk.Revit.DB.Electrical.CableTrayType.IsWithFitting Property

Whether this cable tray type is with fitting

## Syntax (C#)
```csharp
public bool IsWithFitting { get; }
```

## Remarks
True if this cable tray type is with fitting type.